Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: وإذ قال موسى لقومه اذكروا نعمة الله عليكم إذ أنجاكم من آل فرعون يسومونكم سوء العذاب ويذبحون أبناءكم ويستحيون نساءكم وفي ذلكم بلاء من ربكم عظيم
en: And (remind them) how Moses said unto his people: Remember Allah's favour unto you when He delivered you from Pharaoh's folk who were afflicting you with dreadful torment, and were slaying your sons and sparing your women; that was a tremendous trial from your Lord.

source: وإذ تأذن ربكم لئن شكرتم لأزيدنكم ولئن كفرتم إن عذابي لشديد
en: And when your Lord proclaimed: If ye give thanks, I will give you more; but if ye are thankless, lo! My punishment is dire.

source: وقال موسى إن تكفروا أنتم ومن في الأرض جميعا فإن الله لغني حميد
en: And Moses said: Though ye and all who are in the earth prove thankless, lo! Allah verily is Absolute, Owner of Praise.

source: ألم يأتكم نبأ الذين من قبلكم قوم نوح وعاد وثمود والذين من بعدهم لا يعلمهم إلا الله جاءتهم رسلهم بالبينات فردوا أيديهم في أفواههم وقالوا إنا كفرنا بما أرسلتم به وإنا لفي شك مما تدعوننا إليه مريب
en: Hath not the history of those before you reached you: the folk of Noah, and (the tribes of) A'ad and Thamud, and those after them? None save Allah knoweth them. Their messengers came unto them with clear proofs, but they thrust their hands into their mouths, and said: Lo! we disbelieve in that wherewith ye have been sent, and lo! we are in grave doubt concerning that to which ye call us.

source: قالت رسلهم أفي الله شك فاطر السماوات والأرض يدعوكم ليغفر لكم من ذنوبكم ويؤخركم إلى أجل مسمى قالوا إن أنتم إلا بشر مثلنا تريدون أن تصدونا عما كان يعبد آباؤنا فأتونا بسلطان مبين
en: Their messengers said: Can there be doubt concerning Allah, the Creator of the heavens and the earth? He calleth you that He may forgive you your sins and reprieve you unto an appointed term. They said: Ye are but mortals like us, who would fain turn us away from what our fathers used to worship. Then bring some clear warrant.

source: قالت لهم رسلهم إن نحن إلا بشر مثلكم ولكن الله يمن على من يشاء من عباده وما كان لنا أن نأتيكم بسلطان إلا بإذن الله وعلى الله فليتوكل المؤمنون
en: Their messengers said unto them: We are but mortals like you, but Allah giveth grace unto whom He will of His slaves. It is not ours to bring you a warrant unless by the permission of Allah. In Allah let believers put their trust!

source: وما لنا ألا نتوكل على الله وقد هدانا سبلنا ولنصبرن على ما آذيتمونا وعلى الله فليتوكل المتوكلون
en: How should we not put our trust in Allah when He hath shown us our ways? We surely will endure the hurt ye do us. In Allah let the trusting put their trust.

source: وقال الذين كفروا لرسلهم لنخرجنكم من أرضنا أو لتعودن في ملتنا فأوحى إليهم ربهم لنهلكن الظالمين
en: And those who disbelieved said unto their messengers: Verily we will drive you out from our land, unless ye return to our religion. Then their Lord inspired them, (saying): Verily we shall destroy the wrong-doers,

source: ولنسكننكم الأرض من بعدهم ذلك لمن خاف مقامي وخاف وعيد
en: And verily We shall make you to dwell in the land after them. This is for him who feareth My Majesty and feareth My threats.

source: واستفتحوا وخاب كل جبار عنيد
en: And they sought help (from their Lord) and every froward potentate was bought to naught;

source: من ورائه جهنم ويسقى من ماء صديد
en: Hell is before him, and he is made to drink a festering water,

source: يتجرعه ولا يكاد يسيغه ويأتيه الموت من كل مكان وما هو بميت ومن ورائه عذاب غليظ
en: Which he sippeth but can hardly swallow, and death cometh unto him from every side while yet he cannot die, and before him is a harsh doom.

source: مثل الذين كفروا بربهم أعمالهم كرماد اشتدت به الريح في يوم عاصف لا يقدرون مما كسبوا على شيء ذلك هو الضلال البعيد
en: A similitude of those who disbelieve in their Lord: Their works are as ashes which the wind bloweth hard upon a stormy day. They have no control of aught that they have earned. That is the extreme failure.

source: ألم تر أن الله خلق السماوات والأرض بالحق إن يشأ يذهبكم ويأت بخلق جديد
en: Hast thou not seen that Allah hath created the heavens and the earth with truth? If He will, He can remove you and bring (in) some new creation;

source: وما ذلك على الله بعزيز
en: And that is no great matter for Allah.

source: وبرزوا لله جميعا فقال الضعفاء للذين استكبروا إنا كنا لكم تبعا فهل أنتم مغنون عنا من عذاب الله من شيء قالوا لو هدانا الله لهديناكم سواء علينا أجزعنا أم صبرنا ما لنا من محيص
en: They all come forth unto their Lord. Then those who were despised say unto those who were scornful: We were unto you a following, can ye then avert from us aught of Allah's doom? They say: Had Allah guided us, we should have guided you. Whether we rage or patiently endure is (now) all one for us; we have no place of refuge.

source: وقال الشيطان لما قضي الأمر إن الله وعدكم وعد الحق ووعدتكم فأخلفتكم وما كان لي عليكم من سلطان إلا أن دعوتكم فاستجبتم لي فلا تلوموني ولوموا أنفسكم ما أنا بمصرخكم وما أنتم بمصرخي إني كفرت بما أشركتمون من قبل إن الظالمين لهم عذاب أليم
en: And Satan saith, when the matter hath been decided: Lo! Allah promised you a promise of truth; and I promised you, then failed you. And I had no power over you save that I called unto you and ye obeyed me. So blame not, but blame yourselves. I cannot help you, nor can ye help me, Lo! I disbelieved in that which ye before ascribed to me. Lo! for wrong-doers is a painful doom.

source: وأدخل الذين آمنوا وعملوا الصالحات جنات تجري من تحتها الأنهار خالدين فيها بإذن ربهم تحيتهم فيها سلام
en: And those who believed and did good works are made to enter Gardens underneath which rivers flow, therein abiding by permission of their Lord, their greeting therein: Peace!

source: ألم تر كيف ضرب الله مثلا كلمة طيبة كشجرة طيبة أصلها ثابت وفرعها في السماء
en: Seest thou not how Allah coineth a similitude: A goodly saying, as a goodly tree, its root set firm, its branches reaching into heaven,

source: تؤتي أكلها كل حين بإذن ربها ويضرب الله الأمثال للناس لعلهم يتذكرون
en: Giving its fruit at every season by permission of its Lord? Allah coineth the similitudes for mankind in order that they may reflect.

source: ومثل كلمة خبيثة كشجرة خبيثة اجتثت من فوق الأرض ما لها من قرار
en: And the similitude of a bad saying is as a bad tree, uprooted from upon the earth, possessing no stability.

source: يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة ويضل الله الظالمين ويفعل الله ما يشاء
en: Allah confirmeth those who believe by a firm saying in the life of the world and in the Hereafter, and Allah sendeth wrong-doers astray. And Allah doeth what He will.

source: ألم تر إلى الذين بدلوا نعمت الله كفرا وأحلوا قومهم دار البوار
en: Hast thou not seen those who gave the grace of Allah in exchange for thanklessness and led their people down to the Abode of Loss,

source: جهنم يصلونها وبئس القرار
en: (Even to) hell? They are exposed thereto. A hapless end!

source: وجعلوا لله أندادا ليضلوا عن سبيله قل تمتعوا فإن مصيركم إلى النار
en: And they set up rivals to Allah that they may mislead (men) from His way. Say: Enjoy life (while ye may) for lo! your journey's end will be the Fire.

source: قل لعبادي الذين آمنوا يقيموا الصلاة وينفقوا مما رزقناهم سرا وعلانية من قبل أن يأتي يوم لا بيع فيه ولا خلال
en: Tell My bondmen who believe to establish worship and spend of that which We have given them, secretly and publicly, before a day cometh wherein there will be neither traffick nor befriending.

source: الله الذي خلق السماوات والأرض وأنزل من السماء ماء فأخرج به من الثمرات رزقا لكم وسخر لكم الفلك لتجري في البحر بأمره وسخر لكم الأنهار
en: Allah is He Who created the heavens and the earth, and causeth water to descend from the sky, thereby producing fruits as food for you, and maketh the ships to be of service unto you, that they may run upon the sea at His command, and hath made of service unto you the rivers;

source: وسخر لكم الشمس والقمر دائبين وسخر لكم الليل والنهار
en: And maketh the sun and the moon, constant in their courses, to be of service unto you, and hath made of service unto you the night and the day.

source: وآتاكم من كل ما سألتموه وإن تعدوا نعمت الله لا تحصوها إن الإنسان لظلوم كفار
en: And He giveth you of all ye ask of Him, and if ye would count the bounty of Allah ye cannot reckon it. Lo! man is verily a wrong-doer, an ingrate.

source: وإذ قال إبراهيم رب اجعل هذا البلد آمنا واجنبني وبني أن نعبد الأصنام
en: And when Abraham said: My Lord! Make safe this territory, and preserve me and my sons from serving idols.

source: رب إنهن أضللن كثيرا من الناس فمن تبعني فإنه مني ومن عصاني فإنك غفور رحيم
en: My Lord! Lo! they have led many of mankind astray. But whoso followeth me, he verily is of me. And whoso disobeyeth me - Still Thou art Forgiving, Merciful.

source: ربنا إني أسكنت من ذريتي بواد غير ذي زرع عند بيتك المحرم ربنا ليقيموا الصلاة فاجعل أفئدة من الناس تهوي إليهم وارزقهم من الثمرات لعلهم يشكرون
en: Our Lord! Lo! I have settled some of my posterity in an uncultivable valley near unto Thy holy House, our Lord! that they may establish proper worship; so incline some hearts of men that they may yearn toward them, and provide Thou them with fruits in order that they may be thankful.

source: ربنا إنك تعلم ما نخفي وما نعلن وما يخفى على الله من شيء في الأرض ولا في السماء
en: Our Lord! Lo! Thou knowest that which we hide and that which we proclaim. Nothing in the earth or in the heaven is hidden from Allah.

source: الحمد لله الذي وهب لي على الكبر إسماعيل وإسحاق إن ربي لسميع الدعاء
en: Praise be to Allah Who hath given me, in my old age, Ishmael and Isaac! Lo! my Lord is indeed the Hearer of Prayer.

source: رب اجعلني مقيم الصلاة ومن ذريتي ربنا وتقبل دعاء
en: My Lord! Make me to establish proper worship, and some of my posterity (also); our Lord! and accept my prayer.

source: ربنا اغفر لي ولوالدي وللمؤمنين يوم يقوم الحساب
en: Our Lord! Forgive me and my parents and believers on the day when the account is cast.

source: ولا تحسبن الله غافلا عما يعمل الظالمون إنما يؤخرهم ليوم تشخص فيه الأبصار
en: Deem not that Allah is unaware of what the wicked do. He but giveth them a respite till a day when eyes will stare (in terror),

source: مهطعين مقنعي رءوسهم لا يرتد إليهم طرفهم وأفئدتهم هواء
en: As they come hurrying on in fear, their heads upraised, their gaze returning not to them, and their hearts as air.

source: وأنذر الناس يوم يأتيهم العذاب فيقول الذين ظلموا ربنا أخرنا إلى أجل قريب نجب دعوتك ونتبع الرسل أولم تكونوا أقسمتم من قبل ما لكم من زوال
en: And warn mankind of a day when the doom will come upon them, and those who did wrong will say: Our Lord! Reprieve us for a little while. We will obey Thy call and will follow the messengers. (It will be answered): Did ye not swear before that there would be no end for you?

source: وسكنتم في مساكن الذين ظلموا أنفسهم وتبين لكم كيف فعلنا بهم وضربنا لكم الأمثال
en: And (have ye not) dwelt in the dwellings of those who wronged themselves (of old) and (hath it not) become plain to you how We dealt with them and made examples for you?

source: وقد مكروا مكرهم وعند الله مكرهم وإن كان مكرهم لتزول منه الجبال
en: Verily they have plotted their plot, and their plot is with Allah, though their plot were one whereby the mountains should be moved.

source: فلا تحسبن الله مخلف وعده رسله إن الله عزيز ذو انتقام
en: So think not that Allah will fail to keep His promise to His messengers. Lo! Allah is Mighty, Able to Requite (the wrong).

source: يوم تبدل الأرض غير الأرض والسماوات وبرزوا لله الواحد القهار
en: On the day when the earth will be changed to other than the earth, and the heavens (also will be changed) and they will come forth unto Allah, the One, the Almighty,

source: وترى المجرمين يومئذ مقرنين في الأصفاد
en: Thou wilt see the guilty on that day linked together in chains,

source: سرابيلهم من قطران وتغشى وجوههم النار
en: Their raiment of pitch, and the Fire covering their faces,

source: ليجزي الله كل نفس ما كسبت إن الله سريع الحساب
en: That Allah may repay each soul what it hath earned. Lo! Allah is swift at reckoning.

source: هذا بلاغ للناس ولينذروا به وليعلموا أنما هو إله واحد وليذكر أولو الألباب
en: This is a clear message for mankind in order that they may be warned thereby, and that they may know that He is only One Allah, and that men of understanding may take heed.

source: الر تلك آيات الكتاب وقرآن مبين
en: Alif. Lam. Ra. These are verses of the Scripture and a plain Reading.

source: ربما يود الذين كفروا لو كانوا مسلمين
en: It may be that those who disbelieve wish ardently that they were Muslims.

source: ذرهم يأكلوا ويتمتعوا ويلههم الأمل فسوف يعلمون
en: Let them eat and enjoy life, and let (false) hope beguile them. They will come to know!

source: وما أهلكنا من قرية إلا ولها كتاب معلوم
en: And We destroyed no township but there was a known decree for it.

source: ما تسبق من أمة أجلها وما يستأخرون
en: No nation can outstrip its term nor can they lag behind.

source: وقالوا يا أيها الذي نزل عليه الذكر إنك لمجنون
en: And they say: O thou unto whom the Reminder is revealed, lo! thou art indeed a madman!

source: لو ما تأتينا بالملائكة إن كنت من الصادقين
en: Why bringest thou not angels unto us, if thou art of the truthful?

source: ما ننزل الملائكة إلا بالحق وما كانوا إذا منظرين
en: We send not down the angels save with the Fact, and in that case (the disbelievers) would not be tolerated.

source: إنا نحن نزلنا الذكر وإنا له لحافظون
en: Lo! We, even We, reveal the Reminder, and lo! We verily are its Guardian.

source: ولقد أرسلنا من قبلك في شيع الأولين
en: We verily sent (messengers) before thee among the factions of the men of old.

source: وما يأتيهم من رسول إلا كانوا به يستهزئون
en: And never came there unto them a messenger but they did mock him.

source: كذلك نسلكه في قلوب المجرمين
en: Thus do We make it traverse the hearts of the guilty:

source: لا يؤمنون به وقد خلت سنة الأولين
en: They believe not therein, though the example of the men of old hath gone before.

source: ولو فتحنا عليهم بابا من السماء فظلوا فيه يعرجون
en: And even if We opened unto them a gate of heaven and they kept mounting through it,

source: لقالوا إنما سكرت أبصارنا بل نحن قوم مسحورون
en: They would say: Our sight is wrong - nay, but we are folk bewitched.

source: ولقد جعلنا في السماء بروجا وزيناها للناظرين
en: And verily in the heaven we have set mansions of the stars, and We have beautified it for beholders.

source: وحفظناها من كل شيطان رجيم
en: And We have guarded it from every outcast devil,

source: إلا من استرق السمع فأتبعه شهاب مبين
en: Save him who stealeth the hearing, and them doth a clear flame pursue.

source: والأرض مددناها وألقينا فيها رواسي وأنبتنا فيها من كل شيء موزون
en: And the earth have We spread out, and placed therein firm hills, and caused each seemly thing to grow therein.

source: وجعلنا لكم فيها معايش ومن لستم له برازقين
en: And we have given unto you livelihoods therein, and unto those for whom ye provide not.

source: وإن من شيء إلا عندنا خزائنه وما ننزله إلا بقدر معلوم
en: And there is not a thing but with Us are the stores thereof. And we send it not down save in appointed measure.

source: وأرسلنا الرياح لواقح فأنزلنا من السماء ماء فأسقيناكموه وما أنتم له بخازنين
en: And We send the winds fertilising, and cause water to descend from the sky, and give it you to drink. It is not ye who are the holders of the store thereof.

source: وإنا لنحن نحيي ونميت ونحن الوارثون
en: Lo! and it is We, even We, Who quicken and give death, and We are the Inheritor.

source: ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين
en: And verily We know the eager among you and verily We know the laggards.

source: وإن ربك هو يحشرهم إنه حكيم عليم
en: Lo! thy Lord will gather them together. Lo! He is Wise, Aware.

source: ولقد خلقنا الإنسان من صلصال من حمإ مسنون
en: Verily We created man of potter's clay of black mud altered,

source: والجان خلقناه من قبل من نار السموم
en: And the jinn did We create aforetime of essential fire.

source: وإذ قال ربك للملائكة إني خالق بشرا من صلصال من حمإ مسنون
en: And (remember) when thy Lord said unto the angels: Lo! I am creating a mortal out of potter's clay of black mud altered,

source: فإذا سويته ونفخت فيه من روحي فقعوا له ساجدين
en: So, when I have made him and have breathed into him of My Spirit, do ye fall down, prostrating yourselves unto him.

source: فسجد الملائكة كلهم أجمعون
en: So the angels fell prostrate, all of them together

source: إلا إبليس أبى أن يكون مع الساجدين
en: Save Iblis. He refused to be among the prostrate.

source: قال يا إبليس ما لك ألا تكون مع الساجدين
en: He said: O Iblis! What aileth thee that thou art not among the prostrate?

source: قال لم أكن لأسجد لبشر خلقته من صلصال من حمإ مسنون
en: He said: I am not one to prostrate myself unto a mortal whom Thou hast created out of potter's clay of black mud altered!

source: قال فاخرج منها فإنك رجيم
en: He said: Then go thou forth from hence, for lo! thou art outcast.

source: وإن عليك اللعنة إلى يوم الدين
en: And lo! the curse shall be upon thee till the Day of Judgment.

source: قال رب فأنظرني إلى يوم يبعثون
en: He said: My Lord! Reprieve me till the day when they are raised.

source: قال فإنك من المنظرين
en: He said: Then lo! thou art of those reprieved

source: إلى يوم الوقت المعلوم
en: Till the Day of appointed time.

source: قال رب بما أغويتني لأزينن لهم في الأرض ولأغوينهم أجمعين
en: He said: My Lord! Because Thou hast sent me astray, I verily shall adorn the path of error for them in the earth, and shall mislead them every one,

source: إلا عبادك منهم المخلصين
en: Save such of them as are Thy perfectly devoted slaves.

source: قال هذا صراط علي مستقيم
en: He said: This is a right course incumbent upon Me:

source: إن عبادي ليس لك عليهم سلطان إلا من اتبعك من الغاوين
en: Lo! as for My slaves, thou hast no power over any of them save such of the froward as follow thee,

source: وإن جهنم لموعدهم أجمعين
en: And lo! for all such, hell will be the promised place.

source: لها سبعة أبواب لكل باب منهم جزء مقسوم
en: It hath seven gates, and each gate hath an appointed portion.

source: إن المتقين في جنات وعيون
en: Lo! those who ward off (evil) are among gardens and watersprings.

source: ادخلوها بسلام آمنين
en: (And it is said unto them): Enter them in peace, secure.

source: ونزعنا ما في صدورهم من غل إخوانا على سرر متقابلين
en: And We remove whatever rancour may be in their breasts. As brethren, face to face, (they rest) on couches raised.

source: لا يمسهم فيها نصب وما هم منها بمخرجين
en: Toil cometh not unto them there, nor will they be expelled from thence.

source: نبئ عبادي أني أنا الغفور الرحيم
en: Announce, (O Muhammad) unto My slaves that verily I am the Forgiving, the Merciful,

source: وأن عذابي هو العذاب الأليم
en: And that My doom is the dolorous doom.

source: ونبئهم عن ضيف إبراهيم
en: And tell them of Abraham's guests,

source: إذ دخلوا عليه فقالوا سلاما قال إنا منكم وجلون
en: (How) when they came in unto him, and said: Peace. He said: Lo! we are afraid of you.

source: قالوا لا توجل إنا نبشرك بغلام عليم
en: They said: Be not afraid! Lo! we bring thee good tidings of a boy possessing wisdom.

source: قال أبشرتموني على أن مسني الكبر فبم تبشرون
en: He said: Bring ye me good tidings (of a son) when old age hath overtaken me? Of what then can ye bring good tidings?

source: قالوا بشرناك بالحق فلا تكن من القانطين
en: They said: We bring thee good tidings in truth. So be not thou of the despairing.

source: قال ومن يقنط من رحمة ربه إلا الضالون
en: He said: And who despaireth of the mercy of his Lord save those who are astray?

source: قال فما خطبكم أيها المرسلون
en: He said: And afterward what is your business, O ye messengers (of Allah)?

source: قالوا إنا أرسلنا إلى قوم مجرمين
en: They said: We have been sent unto a guilty folk,

source: إلا آل لوط إنا لمنجوهم أجمعين
en: (All) save the family of Lot. Them we shall deliver every one,

source: إلا امرأته قدرنا إنها لمن الغابرين
en: Except his wife, of whom We had decreed that she should be of those who stay behind.

source: فلما جاء آل لوط المرسلون
en: And when the messengers came unto the family of Lot,

source: قال إنكم قوم منكرون
en: He said: Lo! ye are folk unknown (to me).

source: قالوا بل جئناك بما كانوا فيه يمترون
en: They said: Nay, but we bring thee that concerning which they keep disputing,

source: وأتيناك بالحق وإنا لصادقون
en: And bring thee the Truth, and lo! we are truth-tellers.

source: فأسر بأهلك بقطع من الليل واتبع أدبارهم ولا يلتفت منكم أحد وامضوا حيث تؤمرون
en: So travel with thy household in a portion of the night, and follow thou their backs. Let none of you turn round, but go whither ye are commanded.

source: وقضينا إليه ذلك الأمر أن دابر هؤلاء مقطوع مصبحين
en: And We made plain the case to him, that the root of them (who did wrong) was to be cut at early morn.

source: وجاء أهل المدينة يستبشرون
en: And the people of the city came, rejoicing at the news (of new arrivals).

source: قال إن هؤلاء ضيفي فلا تفضحون
en: He said: Lo! they are my guests. Affront me not!

source: واتقوا الله ولا تخزون
en: And keep your duty to Allah, and shame me not!

source: قالوا أولم ننهك عن العالمين
en: They said; Have we not forbidden you from (entertaining) anyone?

source: قال هؤلاء بناتي إن كنتم فاعلين
en: He said: Here are my daughters, if ye must be doing (so).

source: لعمرك إنهم لفي سكرتهم يعمهون
en: By thy life (O Muhammad) they moved blindly in the frenzy of approaching death.

source: فأخذتهم الصيحة مشرقين
en: Then the (Awful) Cry overtook them at the sunrise.

source: فجعلنا عاليها سافلها وأمطرنا عليهم حجارة من سجيل
en: And We utterly confounded them, and We rained upon them stones of heated clay.

source: إن في ذلك لآيات للمتوسمين
en: Lo! therein verily are portents for those who read the signs.

source: وإنها لبسبيل مقيم
en: And lo! it is upon a road still uneffaced.

source: إن في ذلك لآية للمؤمنين
en: Lo! therein is indeed a portent for believers.

source: وإن كان أصحاب الأيكة لظالمين
en: And the dwellers in the wood indeed were evil-doers.

source: فانتقمنا منهم وإنهما لبإمام مبين
en: So we took vengeance on them; and lo! they both are on a high-road plain to see.

source: ولقد كذب أصحاب الحجر المرسلين
en: And the dwellers in Al-Hijr denied (Our) messengers.

source: وآتيناهم آياتنا فكانوا عنها معرضين
en: And we gave them Our revelations, but they were averse to them.

source: وكانوا ينحتون من الجبال بيوتا آمنين
en: And they used to hew out dwellings from the hills, (wherein they dwelt) secure.

source: فأخذتهم الصيحة مصبحين
en: But the (Awful) Cry overtook them at the morning hour,

source: فما أغنى عنهم ما كانوا يكسبون
en: And that which they were wont to count as gain availed them not.

source: وما خلقنا السماوات والأرض وما بينهما إلا بالحق وإن الساعة لآتية فاصفح الصفح الجميل
en: We created not the heavens and the earth and all that is between them save with truth, and lo! the Hour is surely coming. So forgive, (O Muhammad), with a gracious forgiveness.

source: إن ربك هو الخلاق العليم
en: Lo! Thy Lord! He is the All-Wise Creator.

source: ولقد آتيناك سبعا من المثاني والقرآن العظيم
en: We have given thee seven of the oft-repeated (verses) and the great Qur'an.

source: لا تمدن عينيك إلى ما متعنا به أزواجا منهم ولا تحزن عليهم واخفض جناحك للمؤمنين
en: Strain not thine eyes toward that which We cause some wedded pairs among them to enjoin, and be not grieved on their account, and lower thy wing (in tenderness) for the believers.

source: وقل إني أنا النذير المبين
en: And say: Lo! I, even I, am a plain warner,

source: كما أنزلنا على المقتسمين
en: Such as We send down for those who make division,

source: الذين جعلوا القرآن عضين
en: Those who break the Qur'an into parts.

source: فوربك لنسألنهم أجمعين
en: Them, by thy Lord, We shall question, every one,

source: عما كانوا يعملون
en: Of what they used to do.

source: فاصدع بما تؤمر وأعرض عن المشركين
en: So proclaim that which thou art commanded, and withdraw from the idolaters.

source: إنا كفيناك المستهزئين
en: Lo! We defend thee from the scoffers,
